const provincesWithCities: { [key: string]: string[] } = {
  تهران: ["تهران", "کرج", "شهریار"],
  اصفهان: ["اصفهان", "کاشان", "نجف‌آباد"],
  فارس: ["شیراز", "مرودشت", "فسا"],
  "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار"],
  مازندران: ["ساری", "بابلسر", "آمل", "بابل"],
  گیلان: ["رشت", "لاهیجان", "سیاهکل"],
  کرمان: ["کرمان", "رفسنجان", "بم"],
  خوزستان: ["اهواز", "آبادان", "خرمشهر"],
  گلستان: ["گرگان", "علی‌آباد", "مینودشت"],
  اردبیل: ["اردبیل", "مشگین‌شهر", "نمین"],
  یزد: ["یزد", "مهریز", "خاتم"],
  همدان: ["همدان", "اسدآباد", "کبودراهنگ"],
  "چهارمحال و بختیاری": ["شهرکرد", "فارسان", "کوهرنگ"],
  لرستان: ["خرم‌آباد", "بروجرد", "الیگودرز"],
  بوشهر: ["بوشهر", "دیّر", "کنگان"],
  "آذربایجان غربی": ["ارومیه", "خوی", "سردشت"],
  "آذربایجان شرقی": ["تبریز", "مراغه", "اهر"],
  زنجان: ["زنجان", "خدابنده", "ایجرود"],
  قزوین: ["قزوین", "تاکستان", "آلاد"],
  قم: ["قم", "کاشان", "نوش‌آباد"],
};

export default provincesWithCities;
